// 1. Створити скрипт який виводить спливаюче попередження за допомогою alert().
// 2. Вивести повідомлення про те, що дія небезпечна та попросити користувача
// підтвердити дію за допомогою confirm().
// 3. Якщо користувач підтверджує дію, вивести повідомлення "Дякую за підтвердження!".
// 4. Якщо користувач відмовляється, вивести повідомлення "Дію відмінено!".

// Виводимо спливаюче попередження
alert("Увага! Ця дія небезпечна.");

// Запитуємо підтвердження
let isConfirmed = confirm("Ви підтверджуєте дію?");

// Використовуємо тернарний оператор, який насправді є спрощеною умовною конструкцією
alert(isConfirmed ? "Дякую за підтвердження!" : "Дію відмінено!");
